{
  "products": [
    {
      "id": 10001,
      "name": "Mastering React",
      "overview": "A comprehensive guide to building robust applications with React, from basics to advanced topics.",
      "long_description": "Mastering React covers everything you need to become proficient in React, one of the most popular JavaScript libraries for building user interfaces. This book walks you through React's core concepts, including components, state management, and hooks, and delves into advanced patterns and optimization techniques. Whether you're new to React or looking to deepen your understanding, this book provides the tools and insights you need to create high-performance, maintainable applications.",
      "price": 29,
      "poster": "https://images.unsplash.com/photo-1633356122102-3fe601e05bd2?q=80&w=1470&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "rating": 5,
      "in_stock": true,
      "size": 5,
      "best_seller": true
    },
    {
      "id": 10002,
      "name": "Python Programming: A Comprehensive Guide",
      "overview": "Dive into the world of Python with this complete guide, perfect for beginners and advanced users alike.",
      "long_description": "Python Programming: A Comprehensive Guide takes you on a journey through Python, one of the most versatile and widely-used programming languages today. This book starts with the basics of Python syntax and gradually introduces more complex concepts such as object-oriented programming, data structures, and web development. With practical examples and exercises, this book is designed to help you become proficient in Python, whether you're new to programming or an experienced developer.",
      "price": 24,
      "poster": "https://images.unsplash.com/photo-1526379095098-d400fd0bf935?q=80&w=1632&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "rating": 4,
      "in_stock": true,
      "size": 2,
      "best_seller": false
    },
    {
      "id": 10003,
      "name": "JavaScript: The Definitive Guide",
      "overview": "An authoritative guide to JavaScript, covering all aspects from core language features to advanced techniques.",
      "long_description": "JavaScript: The Definitive Guide is a must-have for anyone serious about web development. This book covers the entire JavaScript ecosystem, from the fundamentals of the language to advanced topics like asynchronous programming, ES6+ features, and performance optimization. It also explores the use of JavaScript in different environments, including the browser and Node.js. With this guide, you'll gain a deep understanding of JavaScript and the confidence to tackle any programming challenge.",
      "price": 34,
      "poster": "https://images.unsplash.com/photo-1667372393086-9d4001d51cf1?q=80&w=1632&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "rating": 3,
      "in_stock": true,
      "size": 1,
      "best_seller": false
    },
    {
      "id": 10004,
      "name": "Data Structures and Algorithms in Python",
      "overview": "Learn the essential concepts of data structures and algorithms using Python, with practical examples.",
      "long_description": "Data Structures and Algorithms in Python is your gateway to mastering one of the most critical aspects of computer science. This book covers the fundamental data structures such as arrays, linked lists, stacks, and queues, as well as algorithms for searching, sorting, and graph traversal. Written with a focus on Python, each topic is accompanied by code examples and exercises to reinforce your understanding. Whether you're preparing for coding interviews or aiming to improve your problem-solving skills, this book is an invaluable resource.",
      "price": 39,
      "poster": "https://images.unsplash.com/photo-1600469984476-c713650f1b1b?q=80&w=1470&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "rating": 5,
      "in_stock": true,
      "size": 7,
      "best_seller": true
    },
    {
      "id": 10005,
      "name": "The Art of Clean Code",
      "overview": "A guide to writing clean, maintainable, and efficient code, with best practices and real-world examples.",
      "long_description": "The Art of Clean Code is a deep dive into the principles of writing code that is not only functional but also easy to read, maintain, and extend. This book covers best practices for naming, structuring, and documenting your code, as well as strategies for refactoring and testing. With examples in multiple programming languages, this book is ideal for developers who want to elevate their coding style and produce high-quality, professional-grade software.",
      "price": 31,
      "poster": "https://images.unsplash.com/photo-1546146830-2cca9512c68e?q=80&w=1480&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "rating": 3,
      "in_stock": true,
      "size": 3,
      "best_seller": false
    },
    {
      "id": 10006,
      "name": "Introduction to Machine Learning with Python",
      "overview": "A practical introduction to machine learning concepts using Python, with hands-on examples and projects.",
      "long_description": "Introduction to Machine Learning with Python provides a comprehensive introduction to the field of machine learning, one of the most exciting areas in technology today. This book covers the basics of supervised and unsupervised learning, as well as deep learning and neural networks. Each concept is illustrated with Python code and real-world examples, making it accessible even to those new to the field. By the end of this book, you'll have the skills to build your own machine learning models and apply them to real-world problems.",
      "price": 45,
      "poster": "https://images.unsplash.com/photo-1535378917042-10a22c95931a?q=80&w=1448&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "rating": 5,
      "in_stock": true,
      "size": 10,
      "best_seller": false
    },
    {
      "id": 10007,
      "name": "Full-Stack Development with Node.js and React",
      "overview": "Learn how to build modern, scalable web applications using Node.js and React, from front-end to back-end.",
      "long_description": "Full-Stack Development with Node.js and React is a complete guide to building full-stack web applications using two of the most popular technologies today. The book takes you through the entire development process, from setting up your development environment to deploying your application. You'll learn how to create RESTful APIs with Node.js, build dynamic user interfaces with React, and manage state with Redux. This book is perfect for developers who want to master both the front-end and back-end of web development.",
      "price": 49,
      "poster": "https://images.unsplash.com/photo-1591267990439-bc68529677c3?q=80&w=1453&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "image_local": "/assets/images/10007.avif",
      "rating": 5,
      "in_stock": true,
      "size": 2,
      "best_seller": false
    },
    {
      "id": 10008,
      "name": "Advanced CSS Techniques",
      "overview": "Elevate your web design skills with advanced CSS techniques, including animations, grid, and flexbox.",
      "long_description": "Advanced CSS Techniques is designed for web developers who want to take their CSS skills to the next level. This book covers advanced topics such as CSS Grid, Flexbox, transitions, animations, and responsive design. Each chapter is filled with practical examples and tips for creating visually stunning, responsive websites. Whether you're a front-end developer looking to refine your skills or a designer aiming to create pixel-perfect layouts, this book is your go-to resource.",
      "price": 27,
      "poster": "https://images.unsplash.com/photo-1523437113738-bbd3cc89fb19?q=80&w=1471&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "image_local": "/assets/images/10008.avif",
      "rating": 5,
      "in_stock": true,
      "size": 3,
      "best_seller": true
    },
    {
      "id": 10009,
      "name": "Introduction to Data Science with Python",
      "overview": "Start your journey into data science with this beginner-friendly guide to Python and data analysis.",
      "long_description": "Introduction to Data Science with Python is the perfect starting point for anyone interested in the field of data science. This book covers the basics of data analysis, including data cleaning, visualization, and statistical modeling. Using Python and its powerful libraries such as Pandas, NumPy, and Matplotlib, you'll learn how to work with real-world data and extract valuable insights. Whether you're a beginner or looking to transition into data science, this book provides the foundational knowledge you need.",
      "price": 37,
      "poster": "https://images.unsplash.com/photo-1599658880436-c61792e70672?q=80&w=1470&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "image_local": "/assets/images/10008.avif",
      "rating": 5,
      "in_stock": true,
      "size": 3,
      "best_seller": true
    },
    {
      "id": 10010,
      "name": "Practical DevOps",
      "overview": "A hands-on guide to implementing DevOps practices for continuous integration and delivery.",
      "long_description": "Practical DevOps provides a comprehensive overview of DevOps principles and practices, aimed at improving collaboration between development and operations teams. This book covers the essential tools and techniques for implementing continuous integration, continuous delivery, and infrastructure as code. ",
      "price": 42,
      "poster": "https://images.unsplash.com/photo-1452457750107-cd084dce177d?q=80&w=1602&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "image_local": "/assets/images/10010.avif",
      "rating": 4,
      "in_stock": true,
      "size": 1,
      "best_seller": false
    },
    {
      "id": 10011,
      "name": "Building APIs with Node.js",
      "overview": "Learn to create robust, scalable APIs using Node.js and Express, from the ground up.",
      "long_description": "Building APIs with Node.js is a comprehensive guide to developing APIs that power modern web and mobile applications. This book covers everything from setting up a Node.js environment to building and securing APIs using Express.js. You'll also learn about testing, documentation, and deployment strategies. With practical examples and hands-on exercises, this book is ideal for developers looking to master API development with Node.js.",
      "price": 32,
      "poster": "https://images.unsplash.com/photo-1687603921109-46401b201195?q=80&w=1470&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "image_local": "/assets/images/10011.avif",
      "rating": 5,
      "in_stock": true,
      "size": 3,
      "best_seller": true
    },
    {
      "id": 10012,
      "name": "Deep Learning with TensorFlow",
      "overview": "A deep dive into building and training neural networks using TensorFlow, Google's powerful machine learning framework.",
      "long_description": "Deep Learning with TensorFlow is your ultimate guide to mastering deep learning techniques using TensorFlow. This book covers the fundamentals of neural networks, convolutional networks, recurrent networks, and more. You'll learn how to implement these concepts with TensorFlow, from data preprocessing to model evaluation and optimization. With real-world examples and projects, this book is essential for anyone looking to get into deep learning and artificial intelligence.",
      "price": 59,
      "poster": "https://images.unsplash.com/photo-1718241905696-cb34c2c07bed?q=80&w=1528&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "image_local": "/assets/images/10012.avif",
      "rating": 5,
      "in_stock": true,
      "size": 1,
      "best_seller": false
    },
    {
      "id": 10013,
      "name": "The Rust Programming Language",
      "overview": "An introduction to Rust, a systems programming language focused on safety, speed, and concurrency.",
      "long_description": "The Rust Programming Language is a must-read for anyone interested in systems programming. Rust is known for its safety guarantees, performance, and modern syntax. This book introduces you to Rust's unique concepts, such as ownership, borrowing, and lifetimes, and shows you how to write fast, reliable code. With hands-on examples and exercises, you'll gain a deep understanding of Rust and its capabilities, making it an excellent resource for developers looking to explore this cutting-edge language.",
      "price": 35,
      "poster": "https://images.unsplash.com/photo-1484417894907-623942c8ee29?q=80&w=1632&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "image_local": "/assets/images/10013.avif",
      "rating": 4,
      "in_stock": false,
      "size": 3,
      "best_seller": false
    },
    {
      "id": 10014,
      "name": "Kubernetes in Action",
      "overview": "A practical guide to managing containerized applications with Kubernetes, the leading container orchestration platform.",
      "long_description": "Kubernetes in Action is a hands-on guide to deploying and managing containerized applications using Kubernetes. This book covers the core concepts of Kubernetes, including pods, services, deployments, and stateful sets. You'll also learn about networking, storage, and security in a Kubernetes environment. With step-by-step tutorials and real-world examples, this book is perfect for DevOps engineers and developers looking to harness the power of Kubernetes for their applications.",
      "price": 54,
      "poster": "https://images.unsplash.com/photo-1483817101829-339b08e8d83f?q=80&w=1608&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "image_local": "/assets/images/10014.avif",
      "rating": 4,
      "in_stock": false,
      "size": 3,
      "best_seller": false
    },
    {
      "id": 10015,
      "name": "Web Development with Django",
      "overview": "Build dynamic web applications using Django, the popular Python web framework.",
      "long_description": "Web Development with Django is a complete guide to building powerful web applications with Django. This book covers the basics of setting up a Django project, working with models, views, and templates, and implementing authentication and security features. You'll also learn how to deploy your Django application to a production environment. With practical examples and clear explanations, this book is ideal for Python developers looking to leverage Django for their web projects.",
      "price": 38,
      "poster": "https://images.unsplash.com/photo-1457305237443-44c3d5a30b89?q=80&w=1474&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "image_local": "/assets/images/10015.avif",
      "rating": 3,
      "in_stock": false,
      "size": 1,
      "best_seller": false
    },
    {
      "id": 10016,
      "name": "Effective TypeScript",
      "overview": "Best practices for writing maintainable and efficient TypeScript code, with real-world examples.",
      "long_description": "Effective TypeScript is a must-have resource for any developer working with TypeScript. This book covers the best practices for writing clean, efficient, and maintainable TypeScript code. You'll learn about TypeScript's type system, advanced types, and how to integrate TypeScript with existing JavaScript projects. With practical examples and expert advice, this book will help you write better TypeScript code and make the most of this powerful language.",
      "price": 44,
      "poster": "https://images.unsplash.com/photo-1583770539147-581738d1310a?q=80&w=1471&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "image_local": "/assets/images/10015.avif",
      "rating": 4,
      "in_stock": true,
      "size": 1,
      "best_seller": false
    },
    {
      "id": 10017,
      "name": "Introduction to Cybersecurity",
      "overview": "A beginner-friendly guide to understanding the basics of cybersecurity and protecting digital assets.",
      "long_description": "Introduction to Cybersecurity is the perfect starting point for anyone looking to understand the fundamentals of cybersecurity. This book covers key topics such as network security, encryption, threat detection, and incident response. With practical examples and clear explanations, you'll learn how to protect systems and data from cyber threats. Whether you're new to cybersecurity or looking to expand your knowledge, this book provides a solid foundation for understanding and implementing security measures.",
      "price": 29,
      "poster": "https://images.unsplash.com/photo-1584433144859-1fc3ab64a957?q=80&w=1630&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "image_local": "/assets/images/10015.avif",
      "rating": 5,
      "in_stock": true,
      "size": 1,
      "best_seller": false
    },
    {
      "id": 10018,
      "name": "Practical Docker",
      "overview": "Learn how to use Docker to containerize your applications and streamline your development workflow.",
      "long_description": "Practical Docker is a hands-on guide to using Docker for containerizing applications and managing development environments. This book covers the basics of Docker, including creating Dockerfiles, managing images and containers, and using Docker Compose for multi-container applications. You'll also learn about Docker networking, storage, and security best practices. With step-by-step tutorials and practical examples, this book is ideal for developers and DevOps engineers looking to incorporate Docker into their workflow.",
      "price": 36,
      "poster": "https://images.unsplash.com/photo-1646627927863-19874c27316b?q=80&w=1528&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "image_local": "/assets/images/10015.avif",
      "rating": 5,
      "in_stock": true,
      "size": 1,
      "best_seller": true
    },
    {
      "id": 10019,
      "name": "Vue.js in Action",
      "overview": "A practical guide to building interactive web applications with Vue.js, from basics to advanced techniques.",
      "long_description": "Vue.js in Action is a comprehensive guide to building modern web applications using Vue.js, a progressive JavaScript framework. This book covers everything from setting up a Vue.js project to building components, managing state with Vuex, and integrating with APIs. You'll also learn about advanced topics such as routing, server-side rendering, and performance optimization. With practical examples and hands-on exercises, this book is perfect for developers looking to master Vue.js.",
      "price": 33,
      "poster": "https://images.unsplash.com/photo-1607799279861-4dd421887fb3?q=80&w=1470&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "image_local": "/assets/images/10015.avif",
      "rating": 2,
      "in_stock": true,
      "size": 1,
      "best_seller": false
    },
    {
      "id": 10020,
      "name": "AI and Machine Learning for Coders",
      "overview": "A guide to understanding and implementing AI and machine learning algorithms, with hands-on coding examples.",
      "long_description": "AI and Machine Learning for Coders provides a comprehensive introduction to artificial intelligence and machine learning, with a focus on coding. This book covers essential concepts such as supervised and unsupervised learning, neural networks, and natural language processing. You'll learn how to implement these concepts using Python and popular libraries like TensorFlow and Scikit-learn. With practical examples and coding exercises, this book is ideal for developers looking to get started with AI and machine learning.",
      "price": 49,
      "poster": "https://images.unsplash.com/photo-1535378620166-273708d44e4c?q=80&w=1557&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "image_local": "/assets/images/10015.avif",
      "rating": 1,
      "in_stock": true,
      "size": 1,
      "best_seller": false
    }
  ],
  "featured_products": [
    {
      "id": 10004,
      "name": "Data Structures and Algorithms in Python",
      "overview": "Learn the essential concepts of data structures and algorithms using Python, with practical examples.",
      "long_description": "Data Structures and Algorithms in Python is your gateway to mastering one of the most critical aspects of computer science. This book covers the fundamental data structures such as arrays, linked lists, stacks, and queues, as well as algorithms for searching, sorting, and graph traversal. Written with a focus on Python, each topic is accompanied by code examples and exercises to reinforce your understanding. Whether you're preparing for coding interviews or aiming to improve your problem-solving skills, this book is an invaluable resource.",
      "price": 39,
      "poster": "https://images.unsplash.com/photo-1600469984476-c713650f1b1b?q=80&w=1470&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "rating": 5,
      "in_stock": true,
      "size": 7,
      "best_seller": true
    },
    {
      "id": 10006,
      "name": "Introduction to Machine Learning with Python",
      "overview": "A practical introduction to machine learning concepts using Python, with hands-on examples and projects.",
      "long_description": "Introduction to Machine Learning with Python provides a comprehensive introduction to the field of machine learning, one of the most exciting areas in technology today. This book covers the basics of supervised and unsupervised learning, as well as deep learning and neural networks. Each concept is illustrated with Python code and real-world examples, making it accessible even to those new to the field. By the end of this book, you'll have the skills to build your own machine learning models and apply them to real-world problems.",
      "price": 45,
      "poster": "https://images.unsplash.com/photo-1535378917042-10a22c95931a?q=80&w=1448&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "rating": 5,
      "in_stock": true,
      "size": 10,
      "best_seller": false
    },
    {
      "id": 10009,
      "name": "Introduction to Data Science with Python",
      "overview": "Start your journey into data science with this beginner-friendly guide to Python and data analysis.",
      "long_description": "Introduction to Data Science with Python is the perfect starting point for anyone interested in the field of data science. This book covers the basics of data analysis, including data cleaning, visualization, and statistical modeling. Using Python and its powerful libraries such as Pandas, NumPy, and Matplotlib, you'll learn how to work with real-world data and extract valuable insights. Whether you're a beginner or looking to transition into data science, this book provides the foundational knowledge you need.",
      "price": 37,
      "poster": "https://images.unsplash.com/photo-1599658880436-c61792e70672?q=80&w=1470&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "image_local": "/assets/images/10008.avif",
      "rating": 5,
      "in_stock": true,
      "size": 3,
      "best_seller": true
    }
  ],
  "orders": [],
  "users": [
    {
      "email": "codershelf@example.com",
      "password": "$2a$10$McFqDpiQWVd14pR7okZV/e94XAzgko2BfjJf7.rtxH5j3d7p8iuOy",
      "name": "Coder",
      "id": 1
    },
    {
      "email": "pbharath328@gmail.com",
      "password": "$2a$10$39rC2B.Pyc.804PVbHOeaul700BCDyD9bLNuJvW5yljj6AjzrTKUO",
      "name": "Bharath P",
      "id": 2
    }
  ]
}